spangap/spangap-core/esp-idf/sdkconfig.defaults.spangap
# spangap-mandated sdkconfig defaults — settings the spangap-core platform
# needs at the values set here. Layered before the consumer's
# sdkconfig.defaults by spangap-core/cmake/bootstrap.cmake. Consumer values
# override on collision.
#
# Anything that is purely consumer-specific (camera sensor support, app-level
# protocol tuning, board-specific pin assignments, etc.) belongs in the
# consumer's own sdkconfig.defaults — not here.

# WiFi — don't let the WiFi blob cache SSID/BSSID/channel in NVS. Two reasons:
# (1) silent auto-reconnect via cached state would bypass net.cpp's connection
# management. (2) avoids mid-session NVS writes from the radio firmware that
# can disrupt active traffic. PHY-cal NVS writes at boot are unaffected.
CONFIG_ESP_WIFI_NVS_ENABLED=n

# lwIP — enough sockets for HTTP/HTTPS/WS + outbound clients. 24 is comfortable
# for the spangap web stack; raise if a consumer adds many more listeners.
CONFIG_LWIP_MAX_SOCKETS=24

# lwIP — TCP send/recv windows + reuse + oversize MSS. 8 KB each (down from 16 KB)
# is a balance: ample for the spangap web/cli/log streaming, but half the memory —
# these are per active TCP connection and the larger size was eating scarce
# internal DRAM. A consumer needing high-throughput TCP (e.g. video) overrides
# these back up in its own sdkconfig.defaults (see seccam).
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_TCP_OVERSIZE_MSS=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y

# lwIP — PPP support (workaround for ESP-IDF 5.x netif->state conflict with WireGuard)
CONFIG_LWIP_PPP_SUPPORT=y

# WiFi TX — larger BA window for aggregation. Dynamic TX buffers kept modest (16,
# down from 64): each is ~1.6 KB of internal DMA RAM, and 64 was sized for this-
# project bursty video. Lowered for the non-video reticulous build; a video
# consumer overrides DYNAMIC_TX_BUFFER_NUM back up in its own defaults (see seccam).
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
# NOTE: do NOT enable CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP here as a blanket
# default. On display boards (T-Deck) the LCD/LVGL already claim the internal
# DMA pool, and moving WiFi/lwIP toward PSRAM tips the WiFi *static* RX buffers
# (16 × ~1.6 KB, internal-DMA-only — cannot move to PSRAM) over the edge:
# "malloc buffer fail / Expected to init 16 rx buffer, actual is 12" → WiFi
# never inits. The display-less seeed board has the internal headroom and sets
# it per-board. The SD-bounce 0x101 it would have papered over is fixed at the
# source instead (SD-on-SPI skips the bounce — see spangap-core CMakeLists).

# PSRAM — present on every target.
# Mode (octal vs quad) is board hardware, so each board sets it in its own
# sdkconfig.defaults (T-Deck S3R8 = octal, Heltec V4 S3R2 = quad) — NOT here.
# 80 MHz is a sane default both current boards use; a board may override.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
# Malloc placement: 0 = every untagged allocation goes to PSRAM. Internal DRAM
# is the scarce resource here (~73 KB free, and WiFi's static RX wants ~25 KB of
# DMA-capable internal RAM), so we keep the default at PSRAM and pin ONLY the few
# things that MUST be internal — ISR/critical-section control structures (driver
# ring buffers, queues) — with explicit MALLOC_CAP_INTERNAL at their call sites
# (ITS inbox/streams, USB-JTAG ring). Tested the inverse (=16384, internal-pref):
# it pulled ~28 KB into DRAM — almost all of it PSRAM-safe UI/buffer data (LVGL,
# CLI) — and dropped DMA-lowest to 19 KB *with WiFi off*, which won't survive WiFi
# on. So: PSRAM-default + surgical internal pins, not internal-default.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# Allow individual .bss symbols to be placed in PSRAM via EXT_RAM_BSS_ATTR
# (exposed as PSRAM_BSS in mem.h). Heap wrappers (operator new / gp_alloc) can
# only route dynamic allocations off internal DRAM; large static arrays are .bss
# and stay internal unless tagged. Opt-in per symbol, so enabling this alone
# moves nothing — only PSRAM_BSS-annotated data, which must never be touched
# from an ISR/spinlock/cache-disabled path.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# Reserve internal DRAM for DMA-capable allocations. Consumers that can ONLY
# live in internal DMA RAM and all peak together at boot: WiFi static RX
# (16 × ~1.6 KB), mbedTLS/lwIP, and — the one that bites — IDF's spi_master
# bounce for SD-on-SPI *reads*. Every single-sector SDSPI read transfers
# 512 B + 2 CRC = 514 B, which is not 4-byte aligned, so spi_master allocates a
# fresh ~516 B internal-DMA temp buffer per read (esp_driver_spi
# setup_dma_priv_buffer). At the boot peak (WiFi scan + LCD + LoRa + LXMF
# opening an SD file) the 48 KB reserve was occasionally exhausted, that tiny
# alloc returned NULL, and IDF's cleanup path NULL-derefs (memcpy from a
# never-assigned buffer_to_rcv) → boot-loop. It was a race: most boots lost,
# one eventually won, so the reserve has to cover the whole peak with margin.
# (This is a *read*-path sibling of the SD-write 0x101 fix; writes were staged
# aligned, reads go through IDF's own block_buf and can't be pre-aligned here.)
# 96 KB is what that peak costs today: the TinyUSB device stack the console
# transport switch needs is linked into every build and holds internal .bss
# whether or not it is ever installed, and it eats into this reserve. Every
# further internal-only consumer added to the image spends from here, so this
# number tracks the image — if the boot-peak alloc failure reappears, the
# consumer list grew, not the race.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304

# Per-task heap ownership tracking (for heapDump on malloc failures)
CONFIG_HEAP_TASK_TRACKING=y

# Heap-corruption diagnostics are opt-in via Kconfig now (OFF by default — the
# stray-write/UAF hunt they were installed for is fixed: the main_task-TCB UAF
# was an orphaned cleanup hook, fixed by CONFIG_FREERTOS_TASK_PRE_DELETION_HOOK
# wiring its.cpp's vTaskPreDeletionHook). To re-arm the kit, enable
# CONFIG_SPANGAP_HEAP_INTEGRITY_POLL (Component config → spangap-core) — one
# switch that also pulls in comprehensive poisoning + the strict PTRVAL stack
# check. Set CONFIG_SPANGAP_WATCH_ADDR=<addr> to catch a UAF writer's backtrace.

# --- PARKED: heap-corruption hunt. The prime suspect (the lcd task overflowing
# its 16 KB PSRAM stack into adjacent PSRAM) is now fixed (lcd stack → 32 KB), so
# the poisoning kit is stood down to remove its CPU cost while we confirm the
# genBuf panic is gone and to keep input timing clean. Re-enable all three lines
# if `genBuf ... outside heap` / a stack overflow recurs:
#   CONFIG_SPANGAP_HEAP_INTEGRITY_POLL=y
#   CONFIG_HEAP_POISONING_COMPREHENSIVE=y
#   CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y

# IPC task stack — IDF default 1280 B is enough for the bare IPC service but not
# for cross-core init callbacks: the LittleFS init path that runs on ipc0 during
# spangap_init has been seen to overflow 1280 B. 4 KiB gives comfortable room.
CONFIG_ESP_IPC_TASK_STACK_SIZE=4096

# Idle task stack — SMP idle runs deferred-free hooks that can overflow the
# 1536 B default.
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048

# IPv6 SLAAC — form a global address from router RAs so devices reach v6-only
# hosts (the dial path is AF_UNSPEC). Platform-wide networking policy.
CONFIG_LWIP_IPV6_AUTOCONFIG=y

# Power management + tickless idle (required for automatic light sleep)
CONFIG_PM_ENABLE=y
CONFIG_PM_PROFILING=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
# Light-sleep enter/exit callbacks (pmOnLightSleepWake): a wake source whose
# level-triggered ISR can miss a bounced press needs to re-check on the wake
# itself, not just when the post-wake interrupt is sampled.
CONFIG_PM_LIGHT_SLEEP_CALLBACKS=y

# FAT — long filenames (strftime patterns exceed 8.3).
# exFAT was removed from ESP-IDF 5.4 menuconfig — SD cards must be FAT32.
CONFIG_FATFS_LFN_HEAP=y
# FATFS sector size = 512 B (down from IDF's 4096 default). FF_MAX_SS is set
# from the FATFS_SECTOR_SIZE *choice* (NOT from CONFIG_WL_SECTOR_SIZE — that's
# the wear-levelling layer, and we have no WL partition: flash is LittleFS).
# Every per-file cache + the volume window is sized to FF_MAX_SS. IDF defaults
# this choice to 4096, which exists only to serve 4K-sector media / wear-
# levelled FAT-on-flash. Our SD card is physically 512 B and the allocation
# unit (SPANGAP_SDCARD_ALLOC_KB, the FAT cluster size) is independent of the
# sector size — 8 KB clusters are 16 × 512 B sectors, no 4096 sector needed.
# Dropping to 512 shrinks each per-file cache + the window 8× (~25 KB across
# max_files=6 + the volume) with no downside. See SPANGAP_SDCARD_MAX_FILES.
CONFIG_FATFS_SECTOR_512=y
# WL sector size is irrelevant here (no WL partition) but pin it to 512 too so
# nothing silently inherits the 4096 default if a WL-backed FAT is ever added.
CONFIG_WL_SECTOR_SIZE_512=y

# C++ — no exceptions or RTTI (not used)
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# Partition table — spangap generates partitions.csv at configure time and
# shrink-wraps it post-build (see scripts/gen-partitions.py). It's a size-
# agnostic FLOOR image: `state` is absent and created at runtime in fs.cpp.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash size = the floor: default 4 MB so one image boots on any chip >= 4 MB and
# the firmware self-grows to the real size at first boot. A board that wants to
# PIN a size (no self-grow) overrides this in its own sdkconfig.defaults / kconfig.
# (Updater on/off is derived from whether spangap/updater is staged — bootstrap.cmake.)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# FreeRTOS — task stats for 'top' command
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# Task pre-deletion hook — REQUIRED so its.cpp's vTaskPreDeletionHook fires when a
# task is deleted, nulling its stale s_tasks slot. Without this, a self-deleting
# task that touched ITS (canonically main_task, which drives boot proxy ops then
# returns from app_main) leaves a dangling TaskHandle; a later notify routed to
# that slot writes into the freed TCB — a use-after-free that the heap-poisoning
# poll catches as CORRUPT HEAP. IDF 5.5's live hook is vTaskPreDeletionHook; the
# legacy vPortCleanUpTCB path (CONFIG_FREERTOS_ENABLE_STATIC_TASK_CLEAN_UP) is
# deprecated, so we must use this one or the cleanup never runs.
CONFIG_FREERTOS_TASK_PRE_DELETION_HOOK=y

# Per-task CPU boost (pm.cpp): slot 0 left for IDF, slot 1 (TLS_PM_BOOST) holds
# each boosted task's CPU_FREQ_MAX handle. Must be > TLS_PM_BOOST or pm.cpp #errors.
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=2

# Log — compile-time max level (runtime filtering via esp_log_level_set)
# Boot at INFO (quiet), compile VERBOSE so all levels work at runtime via "set log=..."
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Task watchdog — don't monitor IDLE1 (core 1 hosts heavy workers in spangap
# and most consumers).
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Bootloader (RTC) watchdog — recover from a boot stall anywhere in init. Before
# the scheduler exists the task/int WDTs aren't running, so the RTC_WDT (a
# hardware timer in the RTC domain that fires regardless of CPU state) is the
# only thing that can break a hang. IDF's default disables it at
# init_disable_rtc_wdt (~1s in, the last SECONDARY sysinit) — which covers the
# octal-PSRAM @80MHz bring-up spin (esp_psram_impl_enable, marginal MSPI timing
# on the S3R8) but leaves the LATER window UNGUARDED: every straddle's hardware
# bring-up (LCD/touch/LoRa/SD I2C+SPI probes) runs after that point, and a stall
# there wedges forever (observed: sporadic dead hang, ~hourly during dev resets,
# nothing recovers it). DISABLE_IN_USER_CODE keeps the RTC_WDT armed across the
# WHOLE boot; spangapPostAppInit() disables it only once every init hook has run
# (see spangap_init.cpp) — past there the scheduler's WDTs take over. Timeout
# raised 3s→8s because the watched window now spans all synchronous init (SD
# mount + storageLoad + EC keygen + hardware probes ≈ a few seconds; everything
# network is async). Err generous: a too-short timeout would BOOT-LOOP a slow-
# but-healthy boot, which is worse than ~8s auto-recovery from a real (rare) hang.
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_WDT_DISABLE_IN_USER_CODE=y
CONFIG_BOOTLOADER_WDT_TIME_MS=8000

# Console over USB Serial JTAG (most spangap targets have no UART pins exposed)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# IDF 5.5+: auto-hold a NO_LIGHT_SLEEP lock while USB host is connected.
# Without this, light sleep gates the USB clock → no SOF packets →
# usb_serial_jtag_is_connected() returns false → vfs_read/write start
# returning -1 → serial console dies. See esp-idf usb_serial_jtag_connection_monitor.c.
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# Hold the panic output before resetting. On a USB console the device leaves the
# bus the moment it resets, and with no delay the backtrace is still in the TX
# FIFO when the host loses the port — a crash then reads as a silent reboot.
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=5

# `usb cdc` moves the console onto a TinyUSB composite device. Two CDC-ACM
# ports is the hardware ceiling: each claims an interrupt IN endpoint plus a
# bulk IN/OUT pair, and the OTG core has five IN endpoints past EP0.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=2

# Headroom above the number of filesystems actually mounted at once (default 8,
# which a running device fills exactly: console, uart, usbserjtag, null, lwip
# sockets, littlefs, FAT, and the CDC console's own /dev/tusbcdc).
#
# The margin is not optional, because IDF's slot accounting is one-way:
# esp_vfs_unregister() clears the table entry but leaves s_vfs_count at its
# high-water mark, and esp_vfs_register_fs() refuses on that count before it
# looks for a free entry. So a filesystem that comes and goes — /dev/tusbcdc,
# each time the console moves — registers once and is then refused forever,
# ESP_ERR_NO_MEM, with its slot sitting empty. The count settles at the peak
# rather than climbing per cycle, so one spare slot suffices; this leaves four.
CONFIG_VFS_MAX_COUNT=12

# Main task stack — mbedTLS EC key generation needs ~10KB
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Default 2304: WiFi + esp_netif + spangap's log path can overflow sys_evt on first connect
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192

# mbedTLS — TLS server with EC P-256 self-signed cert generation
# CONFIG_MBEDTLS_SSL_PROTO_TLS1_3 is not set
CONFIG_MBEDTLS_TLS_SERVER=y
CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT=y
CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_ECP_C=y
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
# PK_WRITE_C / X509_CRT_WRITE_C / X509_CREATE_C are unconditionally on in
# ESP-IDF 5.4's mbedtls port (no longer a menuconfig option).
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# DTLS 1.2 (WebRTC DataChannel transport)
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
# ChaCha20-Poly1305 cipher suite — faster in software than AES-GCM on Xtensa
# (no table lookups, pure ARQ/add/rotate ops). Avoids the ESP32-S3 hardware
# AES-GCM DMA bug (espressif/esp-idf#12689) entirely.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
# Hardware AES off — spangap negotiates ChaCha20-Poly1305, no AES path is live.
# Also pre-empts the GCM DMA bug (#12689) from any future AES use.
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=8192

# mDNS — task stack in PSRAM (allocations stay in DRAM for speed)
CONFIG_MDNS_TASK_CREATE_FROM_SPIRAM=y

# Flash — QIO mode (ESP32-S3). Size is board hardware: each board sets its own
# CONFIG_ESPTOOLPY_FLASHSIZE_* (both current boards are 16 MB), so no size here.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# NOTE: LVGL / LCD-font defaults (CONFIG_LV_*, CONFIG_LCD_FONT_MIN_VECTOR_PX)
# used to live here, but those symbols only exist when spangap-lcd + the lvgl
# managed component are staged. Asserting them unconditionally made kconfiglib
# warn "unknown kconfig symbol ..." on every headless build (no display board).
# They now live in spangap-lcd's gated `kconfig:` block, applied only when lcd
# is actually staged.

# Target
CONFIG_IDF_TARGET="esp32s3"
